In [1]:
import pandas as pd

In [5]:
dataFrame = pd.read_excel("Kitap1.xlsx")

In [6]:
dataFrame.dropna()

  Unnamed: 0  maas   yas  depertman
0        ali   512  19.0    yazılım
1      fatma  5641  42.0      satıs
3        can  5432  26.0  pazarlama
5     dursun   200  25.0      hukuk